export const ruTranslation = {
    "movie.page.span": "...или посмотрите нашу подборку",
    "movie.card.btn.add": "Добавить в Избранное",
    "movie.card.btn.remove": "Удалить из Избранного",

    "favourite.page.title": "Ваша коллекция любимых фильмов и сериалов",

    "search.box.label": "Начните свой поиск здесь...",

    "menu.menu": "Меню",
    "menu.links.main": "Главная",
    "menu.links.favourites": "Избранное",
    "menu.links.packages": "Пакеты",
    "menu.links.about": "О приложении",
    "menu.links.settings": "Настройки",
    "menu.links.language": "Язык",
    "menu.links.theme": "Тема",

    

    "packages.page.text": "Мы можем предложить Вам следующие платные пакеты:",
    "packages.page.invitation": "Для оформления заказа воспользуйтесь специальной формой ниже:",

    "packages.table.premium": "ПРЕМИУМ",
    "packages.table.optimal": "ОПТИМАЛ",
    "packages.table.light": "ЛАЙТ",
    "packages.form.invitation": "Вы можете оформить Ваш заказ здесь:",
    "packages.form.name": "Имя Фамилия",
    "packages.form.notes": "Дополнительные пожелания",
    "packages.form.select": "Пожалуйста, выберите пакет услуг:",
    "packages.form.submit": "Отправить",
    "packages.form.alert": "Ваш заказ был успешно отправлен!",

    "about.title.1": "Добро пожаловать на страницу приложения ",
    "about.title.2": " !",
    "about.title.span": "Movie Lovers",
    "about.p.1": "Данное приложение было разработано студентом Виктором Здвижковым с использованием библиотеки React в качестве выпускного проекта в школе программирования TeachMeSkills.",
    "about.p.2": "Приложение Movie Lovers поможет Вам найти данные о фильмах и сериалах (год выпуска, страна производства, режиссер, актеры и т.д.) по названию или части названия, которые Вы можете ввести в строке поиска на 'Главной' странице.",
    "about.p.3": "В качестве основной идеи, источника данных о  фильмах, а также для полноценного функционирования данного приложения был использован бесплатный RESTful веб-сервис открытой базы данных фильмов и сериалов OMDb API.",
    "about.p.4": "В приложении Movie Lovers Вы найдете следующие функциональные страницы: 'Главная', 'Избранное', 'Пакеты' и данную страницу с описанием приложения.",
    "about.p.5": "На 'Главной' странице Вы найдете строку поиска, которая поможет вам найти интересующие Вас фильмы или сериалы. На каждой из полученных страниц Вы увидите до 10 результатов поиска. Доступ к следующим 10 результатам можно получить с помощью кнопок переключения страниц внизу 'Главной' страницы.",
    "about.p.6": "Нажатием на афишу (постер) карточки фильма, Вы сможете получить более подробную информацию о выбранном фильме в открывшемся модальном окне.",
    "about.p.7": "Для того, чтобы добавить выбранный Вами фильм в 'Избранное', нажмите на кнопку 'Добавить в Избранное' внизу карточки с фильмом.",
    "about.p.8": "На странице 'Избранное' Вы найдете результаты Ваших поисковых запросов, добавленных с 'Главной' страницы. Они будут храниться в Вашем локальном хранилище и не исчезнут отсюда, даже если Вы обновите страницу. Вы можете удалить из 'Избранного', нажав специальную кнопку 'Удалить из Избранного'.",
    "about.p.9": "Страница 'Пакеты' содержит таблицу с вариантами платных услуг. Внизу данной страницы Вы найдете специальную форму для оформления заказа. В данной форме реализован функционал для обязательного заполнения некоторых полей ввода и установки флажков.",
    "about.p.10": "Для более комфортного использования приложения Movie Lovers, в нем реализована возможность смены языков (русский или английский) и темы (темная или светлая), которые можно изменить по своему вкусу в 'Настройках'  бокового 'Меню'.",
    "about.p.11": "Наслаждайтесь!",

}